# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

from random import sample
def prod (count, number):
    my_list = sample(range(1, 11), count)
    print(my_list)
    result = 1
    n = 1
    if n in 
    
    
print(num_in_list(int(input()), int(input())))
