# Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.
str_1 = input("Введите строку: ")
str_2 = "p"
print(str_1.count(str_2))
